Josiah-crown/cool-breeze-nexus/hardware/Historical ESP32 code/ESP32_HVAC_Enhanced (1).ino
// ============================================
// Read CT Sensor
// ============================================
void readCTSensor(float &current, float &voltage, float &power) {
  int adcValue = analogRead(CT_PIN);
  voltage = (adcValue / 4095.0) * ADC_VREF;
  
  double irms = emon1.calcIrms(1480);
  current = irms;
  
  if(current < MIN_CURRENT_THRESHOLD) {
    current = 0.0;
  } else {
    current = constrain(current, 0, MAX_CURRENT_THRESHOLD);
  }
  
  power = current * LINE_VOLTAGE;
}

// ============================================
// Read Pickup Inputs
// ============================================
void readPickups(float &yVolt, float &gVolt, float &bVolt, float &blVolt,
                 String &yStatus, String &gStatus, String &bStatus, String &blStatus,
                 int &fanSpeed) {
  yVolt = readStableVoltage(GPIO_YELLOW_EXHAUST, yellowFilter);
  gVolt = readStableVoltage(GPIO_GREEN_FAN, greenFilter);
  bVolt = readStableVoltage(GPIO_BROWN_PUMP, brownFilter);
  blVolt = readStableVoltage(GPIO_BLACK_DRAIN, blackFilter);
  
  filterIndex = (filterIndex + 1) % FILTER_SIZE;
  
  yStatus = getStatus(yVolt);
  gStatus = getStatus(gVolt);
  bStatus = getStatus(bVolt);
  blStatus = getStatus(blVolt);
  
  fanSpeed = calculateFanSpeed(gVolt, gStatus);
}

// ============================================
// Read Stable Voltage with Averaging
// ============================================
float readStableVoltage(int pin, float* filterArray) {
  // Discard first readings for ADC settling
  for(int i = 0; i < 10; i++) {
    analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  // Average samples
  long sum = 0;
  for(int i = 0; i < ADC_SAMPLES; i++) {
    sum += analogRead(pin);
    delayMicroseconds(ADC_SAMPLE_DELAY_US);
  }
  
  float avgADC = sum / (float)ADC_SAMPLES;
  float voltage = (avgADC / 4095.0) * ADC_VREF;
  
  // Apply moving average filter
  filterArray[filterIndex] = voltage;
  
  float filteredSum = 0;
  for(int i = 0; i < FILTER_SIZE; i++) {
    filteredSum += filterArray[i];
  }
  
  return filteredSum / FILTER_SIZE;
}

// ============================================
// Get Pickup Status from Voltage
// ============================================
String getStatus(float voltage) {
  if(voltage < VOLTAGE_DISCONNECTED_MAX) {
    return "DISCONNECTED";
  } else if(voltage >= VOLTAGE_ON_MIN && voltage <= VOLTAGE_ON_MAX) {
    return "ON";
  } else if(voltage >= VOLTAGE_OFF_MIN) {
    return "OFF";
  } else {
    return "UNKNOWN";
  }
}

// ============================================
// Calculate Fan Speed
// ============================================
int calculateFanSpeed(float voltage, String status) {
  if(status != "ON") {
    return 0;
  }
  
  if(voltage >= FAN_VOLTAGE_100_SPEED && voltage <= FAN_VOLTAGE_0_SPEED) {
    float speedFloat = 100.0 - ((voltage - FAN_VOLTAGE_100_SPEED) / 
                      (FAN_VOLTAGE_0_SPEED - FAN_VOLTAGE_100_SPEED)) * 100.0;
    return constrain((int)speedFloat, 0, 100);
  } else if(voltage < FAN_VOLTAGE_100_SPEED) {
    return 100;
  } else {
    return 0;
  }
}

// ============================================
// Send Data to Supabase
// ============================================
bool sendToSupabase(float tMotor, float tExterior, float tInterior,
                    float ctCurrent, float ctVoltage, float appPower,
                    float yVolt, float gVolt, float bVolt, float blVolt,
                    bool tankFull,
                    String yStatus, String gStatus, String bStatus, String blStatus,
                    int fanSpeed) {
  
  if(WiFi.status() != WL_CONNECTED) {
    Serial.println("✗ WiFi not connected");
    return false;
  }
  
  HTTPClient http;
  http.setTimeout(HTTP_POST_TIMEOUT);
  
  String endpoint = supabaseUrl + "/rest/v1/readings_raw";
  
  // Build JSON payload
  StaticJsonDocument<1024> doc;
  doc["machine_id"] = machineUUID;
  doc["timestamp"] = getISOTimestamp();
  doc["temp_inside"] = tInterior;
  doc["temp_outside"] = tExterior;
  doc["temp_machine"] = tMotor;
  doc["ct_current"] = ctCurrent;
  doc["water_level"] = tankFull ? 100.0 : 0.0;
  doc["derived_state"] = (bStatus == "ON") ? "on" : "off"; // Pump status
  doc["delta_t"] = tExterior - tInterior;
  
  // State inputs array
  JsonArray inputs = doc.createNestedArray("state_inputs");
  
  JsonObject p1 = inputs.createNestedObject();
  p1["input"] = 1;
  p1["label"] = "exhaust";
  p1["value"] = (yStatus == "ON") ? 1 : 0;
  p1["voltage"] = yVolt;
  
  JsonObject p2 = inputs.createNestedObject();
  p2["input"] = 2;
  p2["label"] = "fan";
  p2["value"] = (gStatus == "ON") ? 1 : 0;
  p2["voltage"] = gVolt;
  p2["speed"] = fanSpeed;
  
  JsonObject p3 = inputs.createNestedObject();
  p3["input"] = 3;
  p3["label"] = "pump";
  p3["value"] = (bStatus == "ON") ? 1 : 0;
  p3["voltage"] = bVolt;
  
  JsonObject p4 = inputs.createNestedObject();
  p4["input"] = 4;
  p4["label"] = "drain";
  p4["value"] = (blStatus == "ON") ? 1 : 0;
  p4["voltage"] = blVolt;
  
  String jsonString;
  serializeJson(doc, jsonString);
  
  Serial.println("\nPOST to Supabase:");
  Serial.println("  URL: " + endpoint);
  Serial.println("  Payload: " + jsonString);
  
  // Send HTTP POST
  http.begin(endpoint);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("apikey", supabaseAnonKey);
  http.addHeader("Authorization", "Bearer " + supabaseAnonKey);
  http.addHeader("Prefer", "return=minimal");
  
  unsigned long postStart = millis();
  int httpCode = http.POST(jsonString);
  unsigned long postDuration = millis() - postStart;
  
  Serial.print("  HTTP Code: ");
  Serial.print(httpCode);
  Serial.print("  (took ");
  Serial.print(postDuration / 1000.0, 1);
  Serial.println(" seconds)");
  
  bool success = false;
  
  if(httpCode == 201 || httpCode == 200) {
    success = true;
    Serial.println("  ✓ Success!");
  } else {
    Serial.println("  ✗ Error: " + http.getString());
  }
  
  http.end();
  
  // Safety check: Disconnect if POST took too long
  if(postDuration > HTTP_POST_TIMEOUT) {
    Serial.println("⚠ POST took longer than expected - forcing disconnect");
  }
  
  return success;
}

