Josiah-crown/cool-breeze-nexus/hardware/Historical ESP32 code/ESP32_HVAC_Enhanced (1).ino
// ============================================
// Get ISO Timestamp
// ============================================
String getISOTimestamp() {
  time_t now = time(nullptr);
  struct tm timeinfo;
  gmtime_r(&now, &timeinfo);
  
  char buffer[30];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", &timeinfo);
  
  return String(buffer);
}

// ============================================
// Launch WiFiManager Config Portal
// ============================================
void launchConfigPortal() {
  Serial.println("\n========================================");
  Serial.println("  CONFIGURATION PORTAL");
  Serial.println("========================================");
  Serial.println("Starting WiFiManager config portal...");
  Serial.println("Connect to WiFi network: 'ESP32_HVAC_Setup'");
  Serial.println("Navigate to: 192.168.4.1");
  Serial.println("========================================\n");
  
  // Start config portal
  wifiManager.startConfigPortal("ESP32_HVAC_Setup");
  
  // After config is saved
  if(WiFi.status() == WL_CONNECTED) {
    Serial.println("✓ WiFi configured and connected!");
  }
}

// ============================================
// WiFiManager Save Config Callback
// ============================================
void saveConfigCallback() {
  Serial.println("\n✓ Config saved - retrieving parameters...");
  
  // Get custom parameters
  supabaseUrl = wifiManager.server->arg("supabase_url");
  supabaseAnonKey = wifiManager.server->arg("supabase_key");
  machineUUID = wifiManager.server->arg("machine_uuid");
  
  // Save to preferences
  preferences.putString("supabase_url", supabaseUrl);
  preferences.putString("supabase_key", supabaseAnonKey);
  preferences.putString("machine_uuid", machineUUID);
  
  Serial.println("  Supabase URL: " + supabaseUrl);
  Serial.println("  Machine UUID: " + machineUUID);
  Serial.println("  Config saved to flash memory");
}

// ============================================
// Perform Daily Reset (Soft Reset)
// ============================================
void performDailyReset() {
  Serial.println("\n========================================");
  Serial.println("  DAILY RESET (24 HOURS ELAPSED)");
  Serial.println("========================================");
  Serial.println("Performing soft reset to clear RAM...");
  
  delay(1000);
  ESP.restart();
}

// ============================================
// Check WiFi Safety Net (Called from loop)
// ============================================
// This is called every loop iteration to ensure WiFi doesn't stay on too long
// Already integrated into main loop via checkWiFiTimeout()
